ams/src/DataProcessors/AMS_ЗаказыКлиентовНаВ2В/AMS_ЗаказыКлиентовНаВ2В.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_ЗаказыКлиентовНаВ2В</name>
  <attributes>
    <name>ТокенАвторизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбновления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартнерКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПартнерИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостоянияДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Клиенты</name>
    <attributes>
      <name>code1c</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>CatalogRef.ГруппыДоступаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоПродаж</name>
      <type>
        <types>CatalogRef.AMS_ПравилаПродаж</types>
      </type>
    </attributes>
    <attributes>
      <name>Соглашение</name>
      <type>
        <types>CatalogRef.СоглашенияСКлиентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>company</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>manager</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>fullName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>creationTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>accessTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>phone</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>email</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>isChecked</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>countOrders</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>amountOrders</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ams/src/Enums/AMS_СтатусыПравилПродаж/AMS_СтатусыПравилПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_СтатусыПравилПродаж</name>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

ams/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <comment>Наименование в латинской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВТранскрипции</name>
    <comment>Наименование в русской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>550</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ЧЗ_МаслоСмазочное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ЧЗ_БытоваяХимия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СокращенноеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/DataProcessors/AMS_ЗаказыКлиентовНаВ2В/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПолучитьЗаказы() Экспорт
	Табл = ПолучитьШаблонТаблицыЗаказов();

	МассивЗаказов = ЗагрузитьЗаказыКлиентовНаВ2В();
	
	Для Каждого Стр Из МассивЗаказов Цикл
		Статус = Стр["status"]["name"];
		
		Если Статус = "Отменен" Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = Табл.Добавить();
		
		НовСтр.Id             = Стр["id"];
		НовСтр.ДатаСоздания   = Дата(1970,1,1) + Стр["creationTime"];
		НовСтр.ДатаОбновления = Дата(1970,1,1) + Стр["updateTime"];
		НовСтр.Статус         = Статус;
		НовСтр.ПартнерИмя     = Стр["client"]["fullName"];
		НовСтр.ПартнерКод     = Стр["client"]["code1c"];
		НовСтр.Сумма          = Стр["baseAmount"];
		НовСтр.Комментарий    = Стр["comment"];
		НовСтр.КонтрагентИмя  = Стр["company"]["name"];
		НовСтр.ИНН            = Формат(Стр["company"]["taxpayerNumber"], "ЧГ=0");
		НовСтр.КПП            = Стр["company"]["ogrn"];
	КонецЦикла; 

	Таб = ПолучитьДанныеДляСписокаЗаказов(Табл);
	
	Заказы.Загрузить(Таб);
КонецПроцедуры

Процедура ПолучитьКлиентов() Экспорт
	МассивКлиентов = ЗагрузитьМассивКлиентовВ2В();
	
	Табл = ПолучитьШаблонТаблицыКлиентов();

	Для Каждого Стр Из МассивКлиентов Цикл
		КодПартнера = Стр["code1c"];
		
		Если ПустаяСтрока(КодПартнера) Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = Табл.Добавить();
		
		НовСтр.code1c       = КодПартнера;
		НовСтр.Id           = Стр["id"];
		НовСтр.fullName     = Стр["fullName"];
		НовСтр.company      = Стр["company"];
		НовСтр.manager      = Стр["manager"];
		
		Если ТипЗнч(Стр["accessTime"]) = Тип("Число") Тогда
			НовСтр.accessTime   = Дата(1970,1,1) + Стр["accessTime"];
		КонецЕсли;
		
		Если ТипЗнч(Стр["creationTime"]) = Тип("Число") Тогда
			НовСтр.creationTime = Дата(1970,1,1) + Стр["creationTime"];
		КонецЕсли;
		
		НовСтр.phone          = Стр["phone"];
		НовСтр.email          = Стр["email"];
		НовСтр.isChecked      = Стр["isChecked"];
		НовСтр.countOrders  = Стр["statistic"]["countOrders"];
		НовСтр.amountOrders  = Стр["statistic"]["amountOrders"];
	КонецЦикла; 
	 
	Таб = ПолучитьТаблицуКлиентов(Табл);
	
	Клиенты.Загрузить(Таб);
КонецПроцедуры

Процедура ВыгрузитьЦеныКлиентаНаВ2В(Код, Соглашение) Экспорт
	HTTPСоединение = Новый HTTPСоединение("b2b.cafe",,,,, AMS_Сервер.ТАЙМАУТ(), Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос("/api/v1.5.4/prices/update_client");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer " + ТокенАвторизации);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("Accept-Language", "ru");
	
	ДанныеЗапроса = Новый Структура();
	ДанныеЗапроса.Вставить("userIds", Код);
	ДанныеЗапроса.Вставить("prices", ПолучитьУстановленныеЦеныКлиента(Соглашение));
	
	ТелоЗапроса = AMS_Сервер.СтруктураВJson(ДанныеЗапроса);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		//@skip-check module-unused-local-variable
		СтруктураОтвета = AMS_Сервер.JSONВСоответствие(ТелоОтвета);
	
	Иначе
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		ТекстОшибки = НСтр("ru = 'ВыгрузитьЦеныКлиентаНаВ2В.Ошибка: %Причина%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ТелоОтвета);
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаказыНаВ2В

Функция ЗагрузитьЗаказыКлиентовНаВ2В()
	МассивЗаказов = Новый Массив();
	
	РежимБезопасности = БезопасныйРежим();
	
	Если ТипЗнч(РежимБезопасности) = тип("Булево") и РежимБезопасности = Истина тогда
		УстановитьОтключениеБезопасногоРежима(Истина);
	КОнецЕсли;
	
	Если ПустаяСтрока(ТокенАвторизации) тогда
		ТокенАвторизации = AMS_Сервер.ПолучитьТокенАвторизации(Пользователи.АвторизованныйПользователь());
	КОнецЕсли;
	
	Если Не ЗначениеЗаполнено(ТокенАвторизации) Тогда
		ВызватьИсключение "Нет токена авторизации";
	КонецЕсли;  

	HTTPСоединение = Новый HTTPСоединение("b2b.cafe",,,,, AMS_Сервер.ТАЙМАУТ(), Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос("/api/v1.5.4/order/list");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer " + ТокенАвторизации);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("Accept-Language", "ru");
	
	Отбор = ОтборЗаказовВ2В();

	ТелоЗапроса = AMS_Сервер.СтруктураВJson(Отбор);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		СтруктураОтвета = AMS_Сервер.JSONВСоответствие(ТелоОтвета); 
		
		Результат = СтруктураОтвета["result"];
		
		МассивЗаказов = Результат["items"];
		
	ИначеЕсли HTTPОтвет.КодСостояния = 401 Тогда	
		ТокенАвторизации = AMS_Сервер.ПолучитьТокенАвторизации(Пользователи.АвторизованныйПользователь());

		ТекстОшибки = НСтр("ru = 'ЗагрузитьЗаказыКлиентовНаВ2В.Ошибка: Истекла авторизация: Нажмите кнопку ""Обновить"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	
	Иначе
		ТекстОшибки = НСтр("ru = 'ЗагрузитьЗаказыКлиентовНаВ2В.Ошибка: Не удалось прочитать файл из временного хранилища по причине: %Причина%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
		
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
		
	Возврат МассивЗаказов;
КонецФункции

Функция ОтборЗаказовВ2В()
	Отбор = Новый Структура();
	
	Отбор.Вставить("storeId", Константы.AMS_В2В_Склад.Получить()); //Фильтр по складу.
	Отбор.Вставить("length",  100); //Количество результатов на странице. При length = 0 – без ограничений. (Стоит учитывать, что без временных интервалов и length = 0, результаты будут за последний месяц)
	Отбор.Вставить("archive", "active"); //Тип заказов: архивные, активные или все.
	
//	Если ЗначениеЗаполнено(Статус) Тогда
//		Отбор.Вставить("status",  Статус); //Код статуса заказа.
//	КонецЕсли;
//
//	Если ЗначениеЗаполнено(Партнер) Тогда
//		Отбор.Вставить("client",  Партнер); //Заказы клиента. Не обязательный параметр.
//	КонецЕсли;
	
//	Отбор.Вставить("offset",             0); //Смещение выборки от начала списка. Используется для постраничной выборки.
//	Отбор.Вставить("amount",             0); //Фильтровать по сумме заказа, будут показаны заказы дороже указанной суммы.
//	Отбор.Вставить("currency",           10); //Идентификатор валюты, в которой требуется показать заказы.
//	Отбор.Вставить("searchId",           10); //Идентификатор заказа, который следует показать.
//	Отбор.Вставить("creationDate",       1557058378); //Фильтровать по дату создания, будут показаны заказы созданные в указанны день.
//	Отбор.Вставить("fromCreationDate",   1557058378); //Фильтр по дате создания, будут показаны заказы созданные после указанной даты. При отсутствии "beforeCreationData" – ограничение в 1 месяц.
//	Отбор.Вставить("beforeCreationDate", 1557058378); //Фильтр по дате создания, будут показаны заказы созданные до указанной даты. При отсутствии "fromCreationData" – ограничение в 1 месяц.
//	Отбор.Вставить("updateDate",         1557058378); //Фильтровать по дату создания, будут показаны заказы обновленные в указанны день.
//	Отбор.Вставить("fromUpdateDate",     1557058378); //Фильтр по дате обновления, будут показаны заказы обновленные после указанной даты. При отсутствии "beforeUpdateData" – ограничение в 1 месяц.
//	Отбор.Вставить("beforeUpdateDate",   1557058378); //Фильтр по дате создания, будут показаны заказы обновленные до указанной даты. При отсутствии "fromUpdateData" – ограничение в 1 месяц.
//	Отбор.Вставить("withProducts",       0); //Флаг для получения содержимого заказов. 0 - без содержимого, 1 - получить содержимое.

	Возврат Отбор;
КонецФункции

Функция ПолучитьДанныеДляСписокаЗаказов(Табл)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Табл", Табл);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Табл.Id КАК Id,
		|	Табл.ДатаСоздания КАК ДатаСоздания,
		|	Табл.ДатаОбновления КАК ДатаОбновления,
		|	Табл.Статус КАК Статус,
		|	Табл.ПартнерИмя КАК ПартнерИмя,
		|	Табл.ПартнерКод КАК ПартнерКод,
		|	Табл.КонтрагентИмя КАК КонтрагентИмя,
		|	ВЫРАЗИТЬ(Табл.ИНН КАК СТРОКА(20)) КАК ИНН,
		|	ВЫРАЗИТЬ(Табл.КПП КАК СТРОКА(20)) КАК КПП,
		|	Табл.Сумма КАК Сумма,
		|	Табл.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	&Табл КАК Табл
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Id
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вт.Id КАК Id,
		|	Парт.Ссылка КАК Партнер,
		|	Парт.ОсновнойМенеджер КАК Менеджер
		|ПОМЕСТИТЬ Парт
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Парт
		|		ПО вт.ПартнерКод = Парт.Код
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Id
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вт.Id КАК Id,
		|	вт.ДатаСоздания КАК ДатаСоздания,
		|	вт.ДатаОбновления КАК ДатаОбновления,
		|	вт.Статус КАК Статус,
		|	вт.ПартнерИмя КАК ПартнерИмя,
		|	вт.ПартнерКод КАК ПартнерКод,
		|	Парт.Партнер КАК Партнер,
		|	вт.КонтрагентИмя КАК КонтрагентИмя,
		|	вт.ИНН КАК ИНН,
		|	вт.КПП КАК КПП,
		|	вт.Сумма КАК Сумма,
		|	вт.Комментарий КАК Комментарий,
		|	Парт.Менеджер КАК Менеджер
		|ПОМЕСТИТЬ таб
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Парт КАК Парт
		|		ПО вт.Id = Парт.Id
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Id
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	таб.Id КАК Id,
		|	Контр.Ссылка КАК Контрагент
		|ПОМЕСТИТЬ Конт
		|ИЗ
		|	таб КАК таб
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контр
		|		ПО таб.Партнер = Контр.Партнер
		|		И (таб.ИНН = Контр.ИНН
		|		И таб.КПП = Контр.КПП
		|		ИЛИ таб.КПП = Контр.НалоговыйНомер)
		|		И таб.КПП = Контр.КПП
		|ГДЕ
		|	НЕ Контр.ПометкаУдаления
		|	И НЕ Контр._Закрыт
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Id
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	таб.Id КАК Id,
		|	таб.ДатаСоздания КАК ДатаСоздания,
		|	таб.ДатаОбновления КАК ДатаОбновления,
		|	таб.Статус КАК Статус,
		|	таб.ПартнерИмя КАК ПартнерИмя,
		|	таб.ПартнерКод КАК ПартнерКод,
		|	таб.Партнер КАК Партнер,
		|	таб.КонтрагентИмя КАК КонтрагентИмя,
		|	Конт.Контрагент КАК Контрагент,
		|	таб.ИНН КАК ИНН,
		|	таб.КПП КАК КПП,
		|	таб.Сумма КАК Сумма,
		|	таб.Менеджер КАК Менеджер,
		|	ДокЗаказ.Дата КАК Дата,
		|	ДокЗаказ.Номер КАК Номер,
		|	ДокЗаказ.Ссылка КАК ЗаказКлиента,
		|	таб.Комментарий КАК Комментарий,
		|	ВЫБОР
		|		КОГДА ДокЗаказ.ПометкаУдаления
		|			ТОГДА 1
		|		ИНАЧЕ ВЫБОР
		|			КОГДА ДокЗаказ.Проведен
		|				ТОГДА 0
		|			ИНАЧЕ 2
		|		КОНЕЦ
		|	КОНЕЦ КАК СостоянияДокумента
		|ИЗ
		|	таб КАК таб
		|		ЛЕВОЕ СОЕДИНЕНИЕ Конт КАК Конт
		|		ПО таб.Id = Конт.Id
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокЗаказ
		|		ПО таб.Id = ДокЗаказ.AMS_ID
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСоздания,
		|	Id";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьШаблонТаблицыЗаказов()
	Табл = Новый ТаблицаЗначений();
	Табл.Колонки.Добавить("Id",             ОбщегоНазначения.ОписаниеТипаЧисло(10));
	Табл.Колонки.Добавить("ДатаСоздания",   ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Табл.Колонки.Добавить("ДатаОбновления", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Табл.Колонки.Добавить("Статус",         ОбщегоНазначения.ОписаниеТипаСтрока(30));
	Табл.Колонки.Добавить("ПартнерИмя",     ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Табл.Колонки.Добавить("ПартнерКод",     ОбщегоНазначения.ОписаниеТипаСтрока(11));
	Табл.Колонки.Добавить("Сумма",          ОбщегоНазначения.ОписаниеТипаЧисло(10, 2));
	Табл.Колонки.Добавить("Комментарий",    ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Табл.Колонки.Добавить("КонтрагентИмя",  ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Табл.Колонки.Добавить("ИНН",            ОбщегоНазначения.ОписаниеТипаСтрока(12));
	Табл.Колонки.Добавить("КПП",            ОбщегоНазначения.ОписаниеТипаСтрока(13));
	
	Возврат Табл;
КонецФункции

#КонецОбласти

#Область КлиентыНаВ2В

Функция ПолучитьТаблицуКлиентов(Табл)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("В2В", Табл);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Парт.Код КАК code1c,
	|	Парт.Ссылка КАК Партнер,
	|	Парт.ГруппаДоступа КАК ГруппаДоступа,
	|	Парт.ОсновнойМенеджер КАК Менеджер
	|ПОМЕСТИТЬ Клиенты
	|ИЗ
	|	Справочник.Партнеры КАК Парт
	|ГДЕ
	|	НЕ Парт.ПометкаУдаления
	|	И НЕ Парт._Закрыт
	|	И Парт.Клиент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.Партнер КАК Партнер,
	|	Правила.Ссылка КАК ПравилоПродаж,
	|	Правила.Соглашение КАК Соглашение
	|ПОМЕСТИТЬ Правила
	|ИЗ
	|	Клиенты КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_ПравилаПродаж КАК Правила
	|		ПО Клиенты.Партнер = Правила.Владелец
	|ГДЕ
	|	НЕ Правила.ПометкаУдаления
	|	И Правила.Основное
	|	И Правила.СтатусПравилаПродажи = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыПравилПродаж.Действует)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.code1c КАК code1c,
	|	Клиенты.Партнер КАК Партнер,
	|	Клиенты.ГруппаДоступа КАК ГруппаДоступа,
	|	Клиенты.Менеджер КАК Менеджер,
	|	Правила.ПравилоПродаж КАК ПравилоПродаж,
	|	Правила.Соглашение КАК Соглашение
	|ПОМЕСТИТЬ С1
	|ИЗ
	|	Клиенты КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Правила КАК Правила
	|		ПО Клиенты.Партнер = Правила.Партнер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	code1c
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Id КАК Id,
	|	т.code1c КАК code1c,
	|	т.fullName КАК fullName,
	|	т.company КАК company,
	|	т.manager КАК manager,
	|	т.accessTime КАК accessTime,
	|	т.creationTime КАК creationTime,
	|	т.phone КАК phone,
	|	т.email КАК email,
	|	т.isChecked КАК isChecked,
	|	т.countOrders КАК countOrders,
	|	т.amountOrders КАК amountOrders
	|ПОМЕСТИТЬ В2В
	|ИЗ
	|	&В2В КАК т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	code1c
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	С1.code1c КАК code1c,
	|	С1.Партнер КАК Партнер,
	|	С1.ГруппаДоступа КАК ГруппаДоступа,
	|	С1.ПравилоПродаж КАК ПравилоПродаж,
	|	С1.Соглашение КАК Соглашение,
	|	С1.Менеджер КАК Менеджер,
	|	В2В.Id КАК Id,
	|	В2В.fullName КАК fullName,
	|	В2В.company КАК company,
	|	В2В.manager КАК manager,
	|	В2В.accessTime КАК accessTime,
	|	В2В.creationTime КАК creationTime,
	|	В2В.phone КАК phone,
	|	В2В.email КАК email,
	|	В2В.isChecked КАК isChecked,
	|	В2В.countOrders КАК countOrders,
	|	В2В.amountOrders КАК amountOrders
	|ИЗ
	|	С1 КАК С1
	|		ЛЕВОЕ СОЕДИНЕНИЕ В2В КАК В2В
	|		ПО С1.code1c = В2В.code1c
	|
	|УПОРЯДОЧИТЬ ПО
	|	С1.ГруппаДоступа.Наименование,
	|	С1.Партнер.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ЗагрузитьМассивКлиентовВ2В()
	МассивКлиентов = Новый Массив();
	
	РежимБезопасности = БезопасныйРежим();
	
	Если ТипЗнч(РежимБезопасности) = тип("Булево") и РежимБезопасности = Истина тогда
		УстановитьОтключениеБезопасногоРежима(Истина);
	КОнецЕсли;
	
	Если ПустаяСтрока(ТокенАвторизации) тогда
		ТокенАвторизации = AMS_Сервер.ПолучитьТокенАвторизации(Пользователи.АвторизованныйПользователь());
	КОнецЕсли;
	
	Если Не ЗначениеЗаполнено(ТокенАвторизации) Тогда
		ВызватьИсключение "Нет токена авторизации";
	КонецЕсли;  

	HTTPСоединение = Новый HTTPСоединение("b2b.cafe",,,,, AMS_Сервер.ТАЙМАУТ(), Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос("/api/v1.5.4/clients/list");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer " + ТокенАвторизации);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("Accept-Language", "ru");
	
	Отбор = Новый Структура();
	Отбор.Вставить("offset", 0);
	Отбор.Вставить("length", 1000);
	Отбор.Вставить("order", "accessTime_desc");

	ТелоЗапроса = AMS_Сервер.СтруктураВJson(Отбор);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		СтруктураОтвета = AMS_Сервер.JSONВСоответствие(ТелоОтвета); 
		
		Результат = СтруктураОтвета["result"];
		
		МассивКлиентов = Результат["items"];
		
	ИначеЕсли HTTPОтвет.КодСостояния = 401 Тогда	
		ТокенАвторизации = AMS_Сервер.ПолучитьТокенАвторизации(Пользователи.АвторизованныйПользователь());

		ТекстОшибки = НСтр("ru = 'ЗагрузитьСписокКлиентовНаВ2В.Ошибка: Истекла авторизация: Нажмите кнопку ""Обновить"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	
	Иначе
		ТекстОшибки = НСтр("ru = 'ЗагрузитьСписокКлиентовНаВ2В.Ошибка: Не удалось прочитать файл из временного хранилища по причине: %Причина%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
		
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
		
	Возврат МассивКлиентов;
КонецФункции

Функция ПолучитьШаблонТаблицыКлиентов()
	Табл = Новый ТаблицаЗначений();
	Табл.Колонки.Добавить("Id",           ОбщегоНазначения.ОписаниеТипаЧисло(10)); //Идентификатор клиента.
	Табл.Колонки.Добавить("code1c",       ОбщегоНазначения.ОписаниеТипаСтрока(11)); //Идентификатор клиента.
	Табл.Колонки.Добавить("fullName",     ОбщегоНазначения.ОписаниеТипаСтрока(200)); //Полное имя пользователя.
	Табл.Колонки.Добавить("company",      ОбщегоНазначения.ОписаниеТипаСтрока(200)); //Название компании клиента. Если нет названия, то будет ИНН. Если нет ИНН, будет ОГРН.
	Табл.Колонки.Добавить("manager",      ОбщегоНазначения.ОписаниеТипаСтрока(200)); //Имя менеджера клиента.
	Табл.Колонки.Добавить("accessTime",   ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя)); //Время последней активности клиента.
	Табл.Колонки.Добавить("creationTime", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя)); //Время регистрации клиента.
	Табл.Колонки.Добавить("phone",        ОбщегоНазначения.ОписаниеТипаСтрока(200)); //Телефон клиента.
	Табл.Колонки.Добавить("email",        ОбщегоНазначения.ОписаниеТипаСтрока(200)); //Email клиента.
	Табл.Колонки.Добавить("isChecked",    Новый ОписаниеТипов("Булево")); //Активирован ли клиент.
	Табл.Колонки.Добавить("countOrders",  ОбщегоНазначения.ОписаниеТипаЧисло(10)); //Количество заказов клиента.
	Табл.Колонки.Добавить("amountOrders",  ОбщегоНазначения.ОписаниеТипаЧисло(15, 2)); //Сумма заказов клиента.
	
	Возврат Табл;
КонецФункции

Функция ПолучитьУстановленныеЦеныКлиента(Соглашение)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	Ном.Код КАК sku,
	|	Ном.Артикул КАК Артикул,
	|	Ном.СтавкаНДС.Ставка КАК Ставка
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Справочник.AMS_Продукция.Товары КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО т.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	т.В2В
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Согл.Ссылка КАК Соглашение,
	|	Согл.ВидЦен КАК ВидЦеныОсновная,
	|	СоглЦенГр.ВидЦен КАК ВидЦеныМега
	|ПОМЕСТИТЬ Согл
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК Согл
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглЦенГр
	|		ПО Согл.Ссылка = СоглЦенГр.Ссылка
	|ГДЕ
	|	Согл.Ссылка = &Соглашение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цен.Номенклатура КАК Номенклатура,
	|	Цен.Цена КАК Цена,
	|	Цен.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ЦеныОсн
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ИСТИНА
	|	И ВидЦены В
	|		(ВЫБРАТЬ
	|			Согл.ВидЦеныОсновная КАК ВидЦеныОсновная
	|		ИЗ
	|			Согл КАК Согл)
	|	И Номенклатура В
	|		(ВЫБРАТЬ
	|			тов.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК тов)) КАК Цен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Цен.Номенклатура,
	|	Цен.Цена,
	|	Цен.ВидЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ИСТИНА
	|	И ВидЦены В
	|		(ВЫБРАТЬ
	|			Согл.ВидЦеныМега КАК ВидЦеныМега
	|		ИЗ
	|			Согл КАК Согл)
	|	И Номенклатура В
	|		(ВЫБРАТЬ
	|			тов.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК тов)) КАК Цен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Согл.Номенклатура КАК Номенклатура,
	|	Согл.Цена КАК Цена,
	|	NULL КАК ВидЦены
	|ПОМЕСТИТЬ ЦенДоп
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.Товары КАК Согл
	|ГДЕ
	|	ИСТИНА
	|	И Согл.Ссылка В
	|		(ВЫБРАТЬ
	|			Согл.Соглашение КАК Соглашение
	|		ИЗ
	|			Согл КАК Согл)
	|	И Согл.Номенклатура В
	|		(ВЫБРАТЬ
	|			тов.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК тов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.sku КАК sku,
	|	ЕСТЬNULL(ЦенДоп.Цена, ЦеныОсн.Цена) КАК price,
	|	тов.Ставка КАК vatRate
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныОсн КАК ЦеныОсн
	|		ПО тов.Номенклатура = ЦеныОсн.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенДоп КАК ЦенДоп
	|		ПО тов.Номенклатура = ЦенДоп.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ЦенДоп.Цена, ЦеныОсн.Цена) > 0";
	
	Табл = Запрос.Выполнить().Выгрузить();
	
	МассивЦен = Новый Массив;
	
	Для каждого Стр Из Табл Цикл
		МассивЦен.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;

	Возврат МассивЦен;
КонецФункции

#КонецОбласти

#Область ЦеныНаВ2В

Функция ПолучитьДанныеПрайсаКлиентаВ2В(Стр) Экспорт
	ЦеноваяГруппаБХ   = Справочники.ЦеновыеГруппы.НайтиПоНаименованию("Бытовая химия");
	ЦеноваяГруппаМЕГА = Справочники.ЦеновыеГруппы.НайтиПоНаименованию("МЕГА");
	
	//@skip-check bsl-legacy-check-string-literal
	ВидЦен1 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Соглашение, "ВидЦен");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Соглашение", Стр.Соглашение);
	Запрос.УстановитьПараметр("ЦеноваяГруппа", ЦеноваяГруппаМЕГА);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.ВидЦен КАК ВидЦен
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК т
	|ГДЕ
	|	т.Ссылка = &Соглашение
	|	И т.ЦеноваяГруппа = &ЦеноваяГруппа";
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		ВидЦен2 = Справочники.ВидыЦен.ПустаяСсылка();
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		ВидЦен2 = Выб.ВидЦен;
	КонецЕсли;

	ВидЦен3 = Справочники.ВидыЦен.НайтиПоНаименованию("Более 1 млн.", Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЦены", Стр.ДатаЦены);
	Запрос.УстановитьПараметр("ЦеноваяГруппаБХ", ЦеноваяГруппаБХ);
	Запрос.УстановитьПараметр("ЦеноваяГруппаМЕГА", ЦеноваяГруппаМЕГА);
	Запрос.УстановитьПараметр("ВидЦен1", ВидЦен1);
	Запрос.УстановитьПараметр("ВидЦен2", ВидЦен2);
	Запрос.УстановитьПараметр("ВидЦен3", ВидЦен3);
	Запрос.УстановитьПараметр("ЦеныВ2В", AMS_Сервер.ПолучитьЦеныКлиентаНаВ2В(Стр.Id));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	AMS_Продукция.Родитель.Наименование КАК ТипПродукции,
	|	AMS_Продукция.Наименование КАК НазначениеПродукции,
	|	AMS_ПродукцияТовары.ТоварныйЗнак КАК ТоварныйЗнак,
	|	AMS_ПродукцияТовары.ТоварныйЗнак.Порядок КАК ТоварныйЗнакПорядок,
	|	AMS_ПродукцияТовары.НомерСтроки КАК НомерСтроки,
	|	AMS_ПродукцияТовары.Номенклатура КАК Номенклатура,
	|	AMS_ПродукцияТовары.КфцРРЦ КАК КфцРРЦ,
	|	Ном.НаименованиеПолное КАК НаименованиеПолное,
	|	AMS_ПродукцияТовары.Маркер КАК Маркер,
	|	Ном.Артикул КАК Артикул,
	|	Ном.Код КАК Код,
	|	AMS_ПродукцияТовары.Объем КАК Объем,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК КолНаМесто,
	|	Ном.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	(100 + СтавкиНДС.Ставка) / 100 КАК Ставка
	|ПОМЕСТИТЬ Ном
	|ИЗ
	|	Справочник.AMS_Продукция КАК AMS_Продукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК AMS_ПродукцияТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|				ПО Ном.СтавкаНДС = СтавкиНДС.Ссылка
	|			ПО AMS_ПродукцияТовары.Номенклатура = Ном.Ссылка
	|		ПО AMS_Продукция.Ссылка = AMS_ПродукцияТовары.Ссылка
	|ГДЕ
	|	НЕ AMS_Продукция.ЭтоГруппа
	|	И AMS_ПродукцияТовары.Прайс
	|	И (Ном.ЦеноваяГруппа = &ЦеноваяГруппаБХ
	|	ИЛИ Ном.ЦеноваяГруппа = &ЦеноваяГруппаМЕГА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК Цена
	|ПОМЕСТИТЬ Цены1
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦен1) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК Цена
	|ПОМЕСТИТЬ Цены2
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦен2) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК Цена
	|ПОМЕСТИТЬ Цены3
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦен3) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ном.ТипПродукции КАК ТипПродукции,
	|	Ном.НазначениеПродукции КАК НазначениеПродукции,
	|	Ном.ТоварныйЗнак КАК ТоварныйЗнак,
	|	Ном.ТоварныйЗнакПорядок КАК ТоварныйЗнакПорядок,
	|	Ном.НомерСтроки КАК НомерСтроки,
	|	Ном.Номенклатура КАК Номенклатура,
	|	Ном.НаименованиеПолное КАК НаименованиеПолное,
	|	Ном.Маркер КАК Маркер,
	|	Ном.Артикул КАК Артикул,
	|	Ном.Код КАК Код,
	|	Ном.Объем КАК Объем,
	|	Ном.КолНаМесто КАК КолНаМесто,
	|	Цены3.Цена * Ном.КфцРРЦ КАК ЦенаРРЦ,
	|	Цены3.Цена * Ном.Ставка * Ном.КфцРРЦ КАК ЦенаРРЦСНДС,
	|	ВЫБОР
	|		КОГДА Ном.ЦеноваяГруппа = &ЦеноваяГруппаБХ
	|			ТОГДА Цены1.Цена
	|		ИНАЧЕ Цены2.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА Ном.ЦеноваяГруппа = &ЦеноваяГруппаБХ
	|			ТОГДА Цены1.Цена * Ном.Ставка
	|		ИНАЧЕ Цены2.Цена * Ном.Ставка
	|	КОНЕЦ КАК ЦенаСНДС
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены1 КАК Цены1
	|		ПО Ном.Номенклатура = Цены1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены2 КАК Цены2
	|		ПО Ном.Номенклатура = Цены2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены3 КАК Цены3
	|		ПО Ном.Номенклатура = Цены3.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Код КАК Код,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ЦеныВ2В
	|ИЗ
	|	&ЦеныВ2В КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.ТипПродукции КАК ТипПродукции,
	|	вт.НазначениеПродукции КАК НазначениеПродукции,
	|	вт.ТоварныйЗнак КАК ТоварныйЗнак,
	|	вт.ТоварныйЗнакПорядок КАК ТоварныйЗнакПорядок,
	|	вт.НомерСтроки КАК НомерСтроки,
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.НаименованиеПолное КАК НаименованиеПолное,
	|	вт.Маркер КАК Маркер,
	|	вт.Артикул КАК Артикул,
	|	вт.Объем КАК Объем,
	|	вт.КолНаМесто КАК КолНаМесто,
	|	вт.ЦенаРРЦ КАК ЦенаРРЦ,
	|	вт.ЦенаРРЦСНДС КАК ЦенаРРЦСНДС,
	|	вт.Цена КАК Цена,
	|	вт.ЦенаСНДС КАК ЦенаСНДС,
	|	ЦеныВ2В.Цена КАК ЦенаВ2В
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныВ2В КАК ЦеныВ2В
	|		ПО вт.Код = ЦеныВ2В.Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипПродукции,
	|	НазначениеПродукции,
	|	ТоварныйЗнакПорядок,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	ТипПродукции,
	|	НазначениеПродукции,
	|	ТоварныйЗнак";

	Возврат Запрос.Выполнить();
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
	
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли
